---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctSizeSettingIterator.Dispose
source: html/61c47714-bf07-6159-12aa-c10bc7c33041.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSizeSettingIterator.Dispose Method

Releases all resources used by the DuctSizeSettingIterator

## Syntax (C#)
```csharp
public void Dispose()
```